[
    {
        "role": "Robotics Architect",
        "company": "Verizon",
        "location": "Basking Ridge, New Jersey",
        "startDate": {
            "month": "Nov",
            "year": 2019
        },
        "endDate": {
            "month": null,
            "year": null
        },
        "details": [
            "Low level and high level development of robotic applications that leverage the power of Verizon 5G and Mobile Edge Computing (MEC) for near real-time wireless control and 'headless' computing",
            "Work with robotic manufacturers like Clearpath, Kinova, and Robotiq"
        ],
        "description": "Robots for 5G!",
        "link": "",
        "image": "verizon_sticker.svg"
    },
    {
        "role": "Robotics Engineer",
        "company": "Siemens",
        "location": "Princeton, New Jersey",
        "startDate": {
            "month": "Feb",
            "year": 2019
        },
        "endDate": {
            "month": "Jul",
            "year": 2019
        },
        "details": [
            "Software architect for a Python based API used to control a robot station comprised of two KUKA arms equipped with wrist cameras",
            "Lead robotics engineer for a LEGO assembly project in the Future of Automation lab at Princeton, NJ. Worked with a talented team of engineers to research concepts in automating end-to-end manufacturing process - from building a bill of processes, simulating its assembly, and then creating the final product."
        ],
        "description": "two handed robots playing with Legos",
        "link": "",
        "image": "siemens_sticker.svg"
    },
    {
        "role": "Robotics Intern",
        "company": "Siemens",
        "location": "Princeton, New Jersey",
        "startDate": {
            "month": "Jul",
            "year": 2018
        },
        "endDate": {
            "month": "Sep",
            "year": 2018
        },
        "details": [
            "Worked with a small team of engineers on a project to build a fully autonomous farming system that used robotic arms and mobile robots to water, prune and harvest plants.",
            "Developed a decentralized, multi-agent control algorithm to coordinate movement between agents operating in the farm."
        ],
        "description": "Autonomous indoor farming",
        "link": "",
        "image": "siemens_sticker.svg"
    },
    {
        "role": "Developer & Consultant",
        "company": "FAST Enterprises",
        "location": "Washington, DC",
        "startDate": {
            "month": "Jul",
            "year": 2015
        },
        "endDate": {
            "month": "Jul",
            "year": 2017
        },
        "details": [
            "Worked with a team to develop and design the 2016/2017 tax return forms for the District of Columbia.",
            "Responsible for the development of online tax return forms on DC’s online Taxpayer Access Portal.",
            "Worked side by side with government clients as a consultant to gather requirements and deliver a streamlined tax solution software."
        ],
        "description": "Making the DC tax system more useful and efficient",
        "link": "",
        "image": "fast_sticker.svg"
    }
]